artillery/artillery-ca-single-phase.yml
config:
  target: 'https://thelist-stage.710labs.com'
  includeFiles:
    - CA-DL.jpg
    - Medical-Card.png
  phases:
    - duration: 900
      arrivalRate: 1
      maxVusers: 10
      name: '10 VU | 15 min | https://thelist-stage.710labs.com'
  engines:
    playwright:
      trace: true
      launchOptions:
        headless: true
  processor: './artillery-scripts.js'
scenarios:
  - engine: playwright
    testFunction: 'CA'