artillery/artillery-ca-single-phase.yml
config:
  target: 'https://thelist-stage.710labs.com'
  includeFiles:
    - CA-DL.jpg
    - Medical-Card.png
  phases:
    - duration: 300
      arrivalRate: 1
      maxVusers: 5
  engines:
    playwright:
      trace: true
      launchOptions:
        headless: true
  processor: './artillery-scripts.js'
scenarios:
  - engine: playwright
    testFunction: 'CA'