artillery/artillery-ca-single-phase.yml
config:
  target: "{{ $processEnvironment.ARTILLERY_TARGET }}"
  includeFiles:
    - CA-DL.jpg
    - Medical-Card.png
  phases:
    - duration: 900
      arrivalRate: 1
      maxVusers: 10
  engines:
    playwright:
      trace: true
      launchOptions:
        headless: true
  processor: './artillery-scripts.js'
scenarios:
  - engine: playwright
    testFunction: 'CA'